Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
inception_v3 (Functional)    (None, 5, 5, 2048)        21802784  
_________________________________________________________________
dropout (Dropout)            (None, 5, 5, 2048)        0         
_________________________________________________________________
global_average_pooling2d (Gl (None, 2048)              0         
_________________________________________________________________
flatten (Flatten)            (None, 2048)              0         
_________________________________________________________________
batch_normalization_94 (Batc (None, 2048)              8192      
_________________________________________________________________
dense (Dense)                (None, 64)                131136    
_________________________________________________________________
batch_normalization_95 (Batc (None, 64)                256       
_________________________________________________________________
activation_94 (Activation)   (None, 64)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                4160      
_________________________________________________________________
batch_normalization_96 (Batc (None, 64)                256       
_________________________________________________________________
activation_95 (Activation)   (None, 64)                0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                4160      
_________________________________________________________________
batch_normalization_97 (Batc (None, 64)                256       
_________________________________________________________________
activation_96 (Activation)   (None, 64)                0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 32)                2080      
_________________________________________________________________
batch_normalization_98 (Batc (None, 32)                128       
_________________________________________________________________
activation_97 (Activation)   (None, 32)                0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 32)                1056      
_________________________________________________________________
batch_normalization_99 (Batc (None, 32)                128       
_________________________________________________________________
activation_98 (Activation)   (None, 32)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 4)                 132       
=================================================================
Total params: 21,954,724
Trainable params: 147,332
Non-trainable params: 21,807,392
_________________________________________________________________
